app/Models/Modelo_Temperatura.php

    public function obtenerTemperaturas()
    {
        $builder = $this->db->table('datos_temperatura');
        $builder->select('*');
        $builder->orderBy('id', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `datos_temperatura`
ORDER BY `id` DESC